In [5]:
import pandas as pd
from datasets import load_dataset

dataset = load_dataset("lukebarousse/data_jobs")
df = dataset['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [6]:
df['job_country'].value_counts().head(20)

job_country
United States     206292
India              51088
United Kingdom     40375
France             39922
Germany            27694
Spain              25100
Singapore          23696
Sudan              21781
Netherlands        20631
Italy              17013
Canada             16029
Mexico             15139
Poland             14793
Portugal           14508
Australia          12955
South Africa       12414
Belgium            12078
Philippines        11786
Ireland            11162
Switzerland         9924
Name: count, dtype: int64

In [10]:
df['job_country'].isin(['Italy']).any()

np.True_

In [14]:
us_job = df[df["job_country"] == "United States"]

In [16]:
us_job = us_job[us_job["salary_year_avg"].notna()]

In [19]:
us_job.groupby("job_title_short")["salary_year_avg"].agg(['min','max','count','median']).sort_values(by = 'median' , ascending= True)

                               min       max  count    median
job_title_short
Business Analyst           35000.0  387460.0    431   90000.0
Data Analyst               25000.0  375000.0   4350   90000.0
Senior Data Analyst        35360.0  425000.0    913  110000.0
Cloud Engineer             42000.0  221844.0     20  116100.0
Data Engineer              23496.0  525000.0   2915  125000.0
Data Scientist             30000.0  960000.0   4553  130000.0
Software Engineer          48982.0  375000.0    157  130000.0
Machine Learning Engineer  44408.5  315000.0    128  150000.0
Senior Data Engineer       45000.0  375000.0   1058  150000.0
Senior Data Scientist      55000.0  475000.0   1241  155000.0